uhnp/src/Catalogs/ПараметрыАмортизацииВНАМСФО/ПараметрыАмортизацииВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыАмортизацииВНАМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизацииМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйОбъемПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ПараметрыАмортизацииВНАМСФО/ManagerModule.bsl
Функция ПолучитьАвтоНаименование(Объект) Экспорт 

	Наименование = "";
	Если ЗначениеЗаполнено(Объект.СпособНачисленияАмортизации) Тогда
		Наименование = Наименование + "Способ: " + Объект.СпособНачисленияАмортизации;
	КонецЕсли;
	
	Если Объект.СрокПолезногоИспользования <> 0 Тогда
		Наименование = ?(Наименование="", "", Наименование + ", ") + НСтр("ru = 'СПИ:'") + Объект.СрокПолезногоИспользования;
	КонецЕсли;
	
	Если НЕ Объект.СпособОтраженияРасходовПоАмортизации.Пустая() Тогда
		Наименование = ?(Наименование="", "", Наименование + ", ") + НСтр("ru = 'Профиль распределения:'") + Объект.СпособОтраженияРасходовПоАмортизации.Наименование;
	КонецЕсли;
	
	Возврат Наименование;

КонецФункции

Функция ПолучитьСобытияИзмененияПараметровАмортизации() Экспорт

	Мас = Новый Массив;
	
	Мас.Добавить(	ПредопределенноеЗначение("Справочник.ВидыОпераций.ВводВЭксплуатацию"));
	Мас.Добавить(	ПредопределенноеЗначение("Справочник.ВидыОпераций.ИзменениеПараметровАмортизации"));
	Мас.Добавить(	ПредопределенноеЗначение("Справочник.ВидыОпераций.МодернизацияВНА"));
	//Мас.Добавить(	ПредопределенноеЗначение("Справочник.ВидыОпераций.Рекласс"));
	
	Возврат Мас;

КонецФункции
